db = db.getSiblingDB('Eshop');
db.createCollection('products');
db.products.createIndex({ name: "text" });

db.products.insertMany([
  {
  name: "ΣΕΤ ΣΑΛΟΝΙ New Toulouse ΓΚΡΙ ΥΦΑΣΜΑ ΜΕ ΑΝΘΡΑΚΙ ΜΑΞΙΛΑΡΙΑ",
  image: "https://www.fylliana.gr/images/products/original/set-saloni-fylliana-new-toulouse-gkri-yfasma-me-anthraki-maxilaria1710168602.jpg",
  description: "Με μοναδικό design που ταιριάζει στο προσωπικό σου στυλ, το σετ καναπέδων σου προσφέρει απόλυτη χαλάρωση και ηρεμία! Έχεις την δυνατότητα να τον επιλέξεις ανάμεσα στα τρία διαφορετικά μοντέρνα χρώματα και να συνδυάσεις τον καναπέ με διακοσμητικά μαξιλάρια, ριχτάρια, χαλιά, της συλλογής μας. Λόγω του μεγέθους του, μπορεί να τοποθετηθεί στο καθιστικό σου, και σε χώρους ψυχαγωγίας για την απόλυτη home cinema εμπειρία, ή και σε επαγγελματικούς χώρους!",
  likes: 4,
  price: 800
},
{
  name: "ΚΑΝΑΠΕΣ ΓΩΝΙΑ ΑΡΙΣΤΕΡΗ New Toulouse ΓΚΡΙ ΥΦΑΣΜΑ ΜΕ ΑΝΘΡΑΚΙ ΜΑΞΙΛΑΡΙΑ 260x205x93εκ",
  image: "https://www.fylliana.gr/images/products/original/kanapes-gonia-aristeri-fylliana-new-toulouse-gkri-yfasma-me-anthraki-maxilaria-260x205x93ek1708086601.jpg",
  description: "Χαλάρωση στη γωνία New Toulouse, όπως εσείς το θέλετε! Με μοναδικό design που ταιριάζει στο προσωπικό σας στυλ, ο γωνιακός καναπές σας προσφέρει απόλυτη χαλάρωση και ηρεμία! Έχετε την δυνατότητα να τον επιλέξετε ανάμεσα στα τρία διαφορετικά μοντέρνα χρώματα και να συνδυάσετε τον καναπέ με διακοσμητικά μαξιλάρια, ριχτάρια, χαλιά, της συλλογής μας. Λόγω του μεγέθους του, μπορεί να τοποθετηθεί στο καθιστικό σας, και φυσικά σε χώρους ψυχαγωγίας για την απόλυτη home cinema εμπειρία.",
  likes: 4,
  price: 900
},
{
  name: "ΚΑΝΑΠΕΣ ΓΩΝΙΑ ΔΕΞΙΑ New Toulouse MOCCA ΥΦΑΣΜΑ ΜΕ TAUPE ΜΑΞΙΛΑΡΙΑ 260x205x93εκ",
  image: "https://www.fylliana.gr/images/products/original/kanapes-gonia-dexia-fylliana-new-toulouse-mocca-yfasma-me-taupe-maxilaria-260x205x93ek1708071601.jpg",
  description: "Χαλάρωση στη γωνία New Toulouse, όπως εσείς το θέλετε! Με μοναδικό design που ταιριάζει στο προσωπικό σας στυλ, ο γωνιακός καναπές σας προσφέρει απόλυτη χαλάρωση και ηρεμία! Έχετε την δυνατότητα να τον επιλέξετε ανάμεσα στα τρία διαφορετικά μοντέρνα χρώματα και να συνδυάσετε τον καναπέ με διακοσμητικά μαξιλάρια, ριχτάρια, χαλιά, της συλλογής μας. Λόγω του μεγέθους του, μπορεί να τοποθετηθεί στο καθιστικό σας, και φυσικά σε χώρους ψυχαγωγίας για την απόλυτη home cinema εμπειρία.",
  likes: 10,
  price: 689.9
},
{
  name: "ΓΩΝΙΑΚΟΣ ΚΑΝΑΠΕΣ ΚΡΕΒΑΤΙ Luna ΛΑΔΙ ΧΡΩΜΑ 276x175x83εκ",
  image: "https://www.fylliana.gr/images/products/original/goniakos-kanapes-krebati-luna-ladi-chroma-276x175x83ek1715168702.jpg",
  description: "Από τα πιο σημαντικά έπιπλα σαλονιού είναι οι γωνιακοί καναπέδες. Καθώς είναι ιδανικοί για σαλόνια κάθε μεγέθους, αποτελούν μοναδική επιλογή για την εξοικονόμηση χώρου. Λόγω του εργονομικού σχεδιασμού τους, μπορούν να προσαρμοστούν με άνεση σε μία γωνία και να κάνουν το χώρο πιο λειτουργικό   Επιπλέον, επιτρέπουν σε περισσότερα άτομα να κάθονται ταυτόχρονα με άνεση, δημιουργώντας ζεστή ατμόσφαιρα.",
  likes: 3,
  price: 600
},
{
  name: "ΣΕΤ ΣΑΛΟΝΙ Caen 2+3 ΓΚΡΙ ΥΦΑΣΜΑ ΜΕ ΣΚΟΥΡΟ ΓΚΡΙ ΣΙΡΙΤΙ",
  image: "https://www.fylliana.gr/images/products/original/set-saloni-fylliana-caen-23-gkri-yfasma-me-skoyro-gkri-siriti1646136607.jpg",
  description: "Ανανέωσε τώρα τον επαγγελματικό σου χώρο, ή το καθιστικό σου με την σειρά Caen. Πρόσθεσε καλαισθησία και κομψότητα στον χώρο σου με την σωστή επιλογή ενός από τα τρία έντονα χρώματα της σειράς και κέρδισε τον κάθε επισκέπτη! Κατασκευασμένοι με λεπτομέρεια, αποσπώμενα μαξιλάρια, ημιαδιάβροχο και easy clean ύφασμα θα σε βοηθήσουν να διατηρήσεις τους καναπέδες χρόνια. Είναι η επιλογή που δεν πρέπει να χάσετε αν θέλετε να απογειώσετε τον χώρο σας με μια πνοή φρεσκάδας και λάμψης.",
  likes: 6,
  price: 1500
},
{
  name: "ΚΑΝΑΠΕΣ ΔΕΞΙΑ ΓΩΝΙΑ FIGO ΜΠΕΖ-ΚΑΦΕ 274*179*83",
  image: "https://www.fylliana.gr/images/products/original/kanapes-dexia-gonia-figo-mpez-kafe-274179831659519904.jpg",
  description: "Ανανεώστε τον χώρο σας με έναν μοντέρνο καναπέ, σαν αυτόν της συλλογής μας Figo. Ιδανικά κατασκευασμένος, εξαιρετικής αντοχής και με αποθηκευτικό χώρο, επιτρέπει την πλήρη επίπλωση του καθιστικού σας από αισθητική και λειτουργική άποψη. Επιπλέον, επιτρέπουν σε περισσότερα άτομα να κάθονται ταυτόχρονα με άνεση, δημιουργώντας ζεστή ατμόσφαιρα.",
  likes: 10,
  price: 300
},
{
  name: "ΤΡΑΠΕΖΑΚΙ ΣΑΛΟΝΙΟΥ \"Range\" Μαυρο-Φυσικό 110x60x40εκ",
  image: "https://www.fylliana.gr/images/products/original/trapezaki-salonioy-fylliana-range-wenge-fysiko-11060401649144415.jpg",
  description: "Κάθε σαλόνι χρειάζεται ένα τραπεζάκι και με λίγη φαντασία, το τραπέζι σαλονιού σας μπορεί να γίνει κάτι περισσότερο. Αν χρειάζεστε τραπεζαρία και τραπεζάκι σε ένα, τότε θα πρέπει να πάρετε ένα τραπεζάκι σαλονιού αρκετά μεγάλο. Αν ο χώρος σας είναι μεγάλος, τότε εκτός από το κεντρικό τραπεζάκι μπροστά στον καναπέ, μπορείτε να πάρετε μερικά βοηθητικά τραπεζάκια τα οποία θα τοποθετήσετε στις γωνίες και θα σας χρησιμεύσουν για το σερβίρισμα, ή απλά θα διακοσμήσουν το χώρο.",
  likes: 1,
  price: 200
},
{
  name: "ΚΑΡΕΚΛΑ ΓΡΑΦΕΙΟΥ FL6002 ΜΠΕΖ ΤΕΧΝΟΔΕΡΜΑ 54x59x89εκ",
  image: "https://www.fylliana.gr/images/products/original/karekla-grafeioy-fylliana-fl6002-mpez-technoderma-54x59x89ek1718865903.jpg",
  description: "Η καρέκλα γραφείου FL6002 σε συνδυασμό τεχνοδέρματος με τις οριζόντιες ραφές, με τα μεταλλικά χρωμιωμένα μέρη θα προκαλέσει τον θαυμασμό και τραβήξει όλα τα βλέματα. Τα μπράτσα της καρέκλας έχουν και αυτα επένδυση απο με τεχνόδέρμα. Η καρέκλα διαθέτει επίσης, τις βασικές ρυθμίσεις ύψους και ανάκλισης καθίσματος για να προσφέρει μια ολοκληρωμένη εμπειρία σε όποιον αποφασίσει να την επιλέξει.",
  likes: 13,
  price: 80
},
{
  name: "ΣΕΤ ΜΕΤΑΛΛΙΚΟ ΤΡΑΠΕΖΙ ΚΗΠΟΥ ΜΕ 2 ΚΑΡΕΚΛΕΣ Fylliana \"Edgar\" ΓΚΡΙ ΧΡΩΜΑ 60x60x72εκ",
  image: "https://www.fylliana.gr/images/products/original/set-metalliko-trapezi-kipoy-me-2-karekles-fylliana-edgar-gkri-chroma-60x60x72ek1699623301.jpg",
  description: "Αναβαθμίστε τον εξωτερικό σας χώρο με αυτό το κομψό και λειτουργικό σετ μεταλλικού τραπεζιού κήπου με δύο καρέκλες. Σχεδιασμένο για να συνδυάζει την ανθεκτικότητα με την αισθητική, αυτό το σετ είναι ιδανικό για μικρούς κήπους, βεράντες ή μπαλκόνια.",
  likes: 17,
  price: 430.87
},
{
  name: "ΚΑΡΕΚΛΑ ΓΡΑΦΕΙΟΥ ΜΕ ΜΠΡΑΤΣΑ 6310 ΔΕΡΜΑΤΙΝΗ 62*68*108/118",
  image: "https://www.fylliana.gr/images/products/original/karekla-grafeioy-me-mpratsa-6310-dermatini-6268108-118-1.jpg",
  description: "Η καρέκλα γραφείου σε συνδυασμό τεχνοδέρματος με τις οριζόντιες ραφές, με τα μεταλλικά χρωμιωμένα μέρη θα προκαλέσει τον θαυμασμό και τραβήξει όλα τα βλέματα. Τα μπράτσα της καρέκλας έχουν και αυτα επένδυση απο με τεχνόδέρμα. Η καρέκλα διαθέτει επίσης, τις βασικές ρυθμίσεις ύψους και ανάκλισης καθίσματος για να προσφέρει μια ολοκληρωμένη εμπειρία σε όποιον αποφασίσει να την επιλέξει.",
  likes: 18,
  price: 99.99
},
{
  name: "ΣΤΡΩΜΑ Sensation 160x200 ΜΕ ΔΩΡΟ ΑΔΙΑΒΡΟΧΟ ΕΠΙΣΤΡΩΜΑ ULTRA SONIC",
  image: "https://www.fylliana.gr/images/products/original/stroma-sensation-160x200-me-doro-adiabrocho-epistroma-ultra-sonic1741263909.jpg",
  description: "Αναζητάτε το τέλειο στρώμα για να εξασφαλίσετε την ιδανική ποιότητα ύπνου; Απολαύστε το ανατομικό στρώμα Sensation από τη συλλογή μας. Το στρώμα διαθέτει ελατήρια pocket υψηλής ποιότητας με 7 ζώνες στήριξης και 2 διαφορετικές όψεις - μία με μάλλινη επεξεργασία για το χειμώνα και μία με βαμβακερή επεξεργασία για το καλοκαίρι.",
  likes: 170,
  price: 700
},
{
  name: "ΓΩΝΙΑΚΟ ΣΑΛΟΝΙ ΚΗΠΟΥ 3 ΤΕΜΑΧΙΩΝ Puebla ΓΚΡΙ ΧΡΩΜΑ 270x220x77εκ",
  image: "https://www.fylliana.gr/images/products/original/goniako-saloni-kipoy-3-temachion-fylliana-puebla-gkri-chroma-270x220x77ek1731497702.jpg",
  description: "Αυτό το σετ κήπου Fylliana Puebla είναι ιδανικό για εξωτερικούς χώρους, συνδυάζοντας ανθεκτικότητα και αισθητική. Η χρήση polywood και μεταλλικών σκελετών προσφέρει ένα προϊόν που είναι ανθεκτικό στις καιρικές συνθήκες και απαιτεί ελάχιστη συντήρηση, ενώ τα άνετα μαξιλάρια προσθέτουν μια πινελιά άνεσης και πολυτέλειας.",
  likes: 18,
  price: 888
},
{
  name: "ΠΟΛΥΘΡΟΝΑ C-985 ΓΚΡΙ ΥΦΑΣΜΑ 65x65x83",
  image: "https://www.fylliana.gr/images/products/original/polythrona-fylliana-c-985-gkri-yfasma-6565831654171529.jpg",
  description: "Αρμονικές καμπύλες και μοντέρνος σχεδιασμός συναντιούνται σε μια πολυθρόνα που θα ταιριάξει εύκολα σε οποιοδήποτε περιβάλλον. Με μια αισθητική ισορροπία που ξεχωρίζει χωρίς να κατακλύζει το δωμάτιό σας, θα βρείτε ένα εκατομμύριο τρόπους για να απολαύσετε αυτήν την πολυθρόνα που είναι ένας εύκολος συνδυασμός διαχρονικού σχεδιασμού και σύγχρονης κομψότητας.",
  likes: 11,
  price: 178
},
{
  name: "ΣΕΤ 2 ΤΡΑΠΕΖΑΚΙΑ FL2452 ΚΑΦΕ-ΜΑΥΡΟ ΧΡΩΜΑ 40x40x47εκ & 45x45x51εκ",
  image: "https://www.fylliana.gr/images/products/original/set-2-trapezakia-fylliana-fl2452-kafe-mayro-chroma-40x40x47ek-45x45x51ek1743585602.jpg",
  description: "Ανανεώστε το χώρο σας με αυτό το κομψό σετ δύο στρογγυλών τραπεζιών που συνδυάζουν την παραδοσιακή αισθητική με μοντέρνες πινελιές. Το σετ αποτελείται από δύο τραπεζάκια διαφορετικών μεγεθών, τα οποία μπορούν να χρησιμοποιηθούν είτε ξεχωριστά είτε ως ένα σύνολο για μια εντυπωσιακή και λειτουργική διακόσμηση",
  likes: 47,
  price: 90
},
{
  name: "ΝΤΟΥΛΑΠΑ VALENCIA 220 ΛΕΥΚΟ-ARTISAN OAK-ΛΕΥΚΟ ΜΑΤ 220*62.5*214εκ",
  image: "https://www.fylliana.gr/images/products/original/ntoylapa-valencia-220-leyko-artisan-oak-leyko-mat-220625214ek1666785048.jpg",
  description: "Ο λευκός χρωματισμός της ντουλάπας προσδίδει στον χώρο σας φωτεινότητα και φρεσκάδα. Η μοντέρνα και η αέρινη αισθητική της, την καθιστούν όχι μόνο καλαίσθητη αλλά και μοναδική για την λειτουργικότητα της και τον αποθηκευτικό της χώρο. Μην χάσετε την λευκή ντουλάπα της Valencia.",
  likes: 28,
  price: 369
},
{
  name: "ΚΑΡΕΚΛΑ ΤΡΑΠΕΖΑΡΙΑΣ 1607 ΚΡΕΜ ΥΦΑΣΜΑ ΜΕ ΜΑΥΡΑ ΜΕΤΑΛΛΙΚΑ ΠΟΔΙΑ 48x59x77εκ",
  image: "https://www.fylliana.gr/images/products/original/karekla-trapezarias-fylliana-1607-krem-yfasma-me-mayra-metallika-podia-48x59x77ek1690459202.jpg",
  description: "Eίσαι λάτρης του ιδιαίτερου design; Οι καρέκλες της συλλογής είναι η λύση σου. Σε απλές και αρμονικές γραμμές συνδυασμένες με την υψηλής ποιότητας κατασκευή της,  η συγκεκριμένη καρέκλα αποτελεί ένα αντικείμενο τέχνης. Η minimal αισθητική της σε συνδυασμό με τη σύγχρονη εμφάνισή της, δημιουργούν μια καρέκλα που δεν τραβά απλώς τα βλέμματα, αλλά παράλληλα αποπνέει έναν αέρα κομψότητας που θα συναρπάσει και θα εκτιμηθεί! Ιδανική για το γραφείο, στην κουζίνα ή και το υπνοδωμάτιο.",
  likes: 109,
  price: 35.49
},
{
  name: "ΚΡΕΒΑΤΙ ΣΙΔΕΡΕΝΙΟ ΚΑΦΕ WILLIAM 140x200εκ",
  image: "https://www.fylliana.gr/images/products/original/krebati-siderenio-kafe-william-140200-3.jpg",
  description: "Προσθέστε αυτό το μεταλλικό κρεβάτι στον χώρο σας και αφεθείτε στην αισθητική της συλλογής Fylliana. Με την επιλογή του κρεβατιού William δημιουργείτε έναν χώρο ύπνου που ξεπερνά τα όρια του συνηθισμένου. Κάθε κυκλική λεπτομέρεια του κρεβατιού είναι ένα έργο τέχνης από μόνο του. Η δεξιοτεχνία της κατασκευής αναδεικνύεται με την εξαιρετική προσοχή τόσο στις καμπύλες και τις γραμμές, όσο και στην μεταλλική κατασκευή του. Μην το χάσετε!",
  likes: 4,
  price: 200
},
{
  name: "ΔΙΠΛΟ ΚΡΕΒΑΤΙ DUE LINE ΜΕ ΑΠΟΘΗΚΕΥΤΙΚΟ ΧΩΡΟ ΑΝΟΙΧΤΟ ΚΑΦΕ ΧΡΩΜΑ ΥΦΑΣΜΑΤΟΣ 165x209x115εκ",
  image: "https://www.fylliana.gr/images/products/original/diplo-krebati-due-line-me-apothikeytiko-choro-anoichto-kafe-chroma-yfasmatos-165x209x115ek1721036108.jpg",
  description: "Το διπλό κρεβάτι Due Line επενδεδυμένο με ύφασμα, με αποθηκευτικό χώρο και στρώμα είναι η τέλεια επιλογή για όσους επιθυμούν έναν άνετο και πρακτικό χώρο ύπνου με υψηλή αισθητική. Με τον εργονομικό σχεδιασμό του, την ανθεκτική κατασκευή του και την ευκολία στη χρήση και συντήρηση, αυτό το κρεβάτι θα σας προσφέρει άνεση και ευκολία για πολλά χρόνια, δημιουργώντας έναν ευχάριστο και φιλόξενο χώρο για ξεκούραση και χαλάρωση.",
  likes: 42,
  price: 664
},
{
  name: "ΤΕΤΡΑΓΩΝΟ ΤΡΑΠΕΖΙ ΚΗΠΟΥ Winston ΜΑΣΙΦ ΞΥΛΟ ΤΕΑΚ ΦΥΣΙΚΟ ΧΡΩΜΑ 60x60x75εκ",
  image: "https://www.fylliana.gr/images/products/original/anadiploymeno-tetragono-trapezi-kipoy-fylliana-winston-masif-xylo-teak-fysiko-chroma-60x60x75ek1731072002.jpg",
  description: "Το ξύλινο τραπέζι κήπου Winston είναι η ιδανική λύση για όσους επιθυμούν έναν συνδυασμό λειτουργικότητας, ανθεκτικότητας και κομψότητας στον εξωτερικό τους χώρο. Σχεδιασμένο για να προσφέρει ευκολία στη χρήση και στην αποθήκευση, αυτό το τραπέζι είναι κατάλληλο για κάθε κήπο, βεράντα ή μπαλκόνι.",
  likes: 22,
  price: 267
},
{
  name: "ΤΡΙΘΕΣΙΟΣ ΚΑΝΑΠΕΣ Carmen MINT ΥΦΑΣΜΑ 226x102x89εκ",
  image: "https://www.fylliana.gr/images/products/original/trithesios-kanapes-fylliana-carmen-mint-yfasma-226x102x89ek1737095406.jpg",
  description: "Με μοναδικό design που ταιριάζει στο προσωπικό σας στυλ, ο τριθέσιος καναπές Carmen σας προσφέρει απόλυτη χαλάρωση και ηρεμία! Έχετε την δυνατότητα να τον επιλέξετε ανάμεσα στα τρία διαφορετικά μοντέρνα χρώματα και να συνδυάσετε τον καναπέ με διακοσμητικά μαξιλάρια, ριχτάρια, χαλιά, της συλλογής μας. Λόγω του μεγέθους του, μπορεί να τοποθετηθεί στο καθιστικό σας, και φυσικά σε χώρους ψυχαγωγίας για την απόλυτη home cinema εμπειρία.",
  likes: 71,
  price: 1100
}]);
